app/controllers/kitaitois_controller.rb

  def show
    @kitaitoi = Kitaitoi.find(params[:id])
---
SELECT * FROM "kitaitois" WHERE ("kitaitois"."id" = 1)

  def create
    @kitaitoi = Kitaitoi.new(params[:kitaitoi])

    respond_to do |format|
      if @kitaitoi.save
---
INSERT INTO "kitaitois" ("prenom", "fonction", "nom", "created_at", "updated_at", "telephone", "email") VALUES(E'test', E'chef', E'test', '2010-03-19 22:12:11.264671', '2010-03-19 22:12:11.264671', E'01.40.78.90.90', E'test@test') RETURNING "id"